# AnalyticalModelStartAlignmentMethod Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AnalyticalModelStartAlignmentMethod Property
ParameterTypeId Class See Also
---
"Start Alignment Method"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AnalyticalModelStartAlignmentMethod { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalModelStartAlignmentMethod As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AnalyticalModelStartAlignmentMethod {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace